Tekla Open API Reference for Tekla Structures 2025
DotPrintOutputType Enumeration
 The printer output type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintOutputType
Public Enumeration DotPrintOutputType
Members
Member name | Value | Description
Printer | 0 |  Printer output type.
PDF | 2 |  PDF output type.
Plot | 3 |  Plot output type.
Image | 4 |  Image png output type.
See Also
Reference
Tekla.Structures.Drawing Namespace